In [3]:
import csv

In [ ]:
#how to extract whole data frame using a condition like array(array.age.isna) from  a 2d 3d datafram , row major , col major

In [11]:
with open ("accounts.csv",'w',newline='') as accounts:
    writer=csv.writer(accounts)
    writer.writerow([100,'jones',24.56])
    writer.writerow([101,'javed',44.56])
    writer.writerow([102,'ahmed',14.56])
    writer.writerow([103,'aslam',34.56])
    writer.writerows([
        [104,'philip',24.56],
        [105,'adam',10.53]
    ])
    accounts.close()

In [19]:
with open('accounts.csv','r',newline='')as accounts:
    print(f'{"Account":<10}{"Name":<10}{"Balance":>10}')
    reader=csv.reader(accounts)
    for record in reader:
        account,name,balance=record
        print(f'{account:<10}{name:<10}{balance:>10}')
        #print(type(record))        
accounts.close

Account   Name         Balance
100       jones          24.56
101       javed          44.56
102       ahmed          14.56
103       aslam          34.56
104       philip         24.56
105       adam           10.53

In [20]:
import pandas as pd
df=pd.read_csv('accounts.csv',names=['account','name','balance'])
df

   account    name  balance
0      100   jones    24.56
1      101   javed    44.56
2      102   ahmed    14.56
3      103   aslam    34.56
4      104  philip    24.56
5      105    adam    10.53

In [27]:
df.to_csv('accounts_from_dataframe.csv',index=False)
df1=pd.read_csv('accounts_from_dataframe.csv')
#df1.index=['Unnamed : 0 ']
df1

   account    name  balance
0      100   jones    24.56
1      101   javed    44.56
2      102   ahmed    14.56
3      103   aslam    34.56
4      104  philip    24.56
5      105    adam    10.53